; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l11-t1-p2---int100n150-m25---int100c150---s118---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level17 level24 level41)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level18 level24 level42)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level19 level24 level43)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level20 level24 level44)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level21 level24 level45)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level22 level24 level46)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level23 level24 level47)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level24 level24 level48)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level25 level24 level49)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level26 level24 level50)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level27 level24 level51)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level28 level24 level52)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level29 level24 level53)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level30 level24 level54)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level31 level24 level55)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level32 level24 level56)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level33 level10 level43)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level33 level24 level57)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level34 level10 level44)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level34 level24 level58)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level35 level10 level45)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level35 level24 level59)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level7 level43)
(sum level36 level10 level46)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level36 level24 level60)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level7 level44)
(sum level37 level10 level47)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level37 level24 level61)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level7 level45)
(sum level38 level10 level48)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level21 level59)
(sum level38 level24 level62)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level7 level46)
(sum level39 level10 level49)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level21 level60)
(sum level39 level24 level63)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level7 level47)
(sum level40 level10 level50)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level21 level61)
(sum level40 level24 level64)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level7 level48)
(sum level41 level10 level51)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level21 level62)
(sum level41 level24 level65)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level7 level49)
(sum level42 level10 level52)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level21 level63)
(sum level42 level24 level66)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level7 level50)
(sum level43 level10 level53)
(sum level43 level14 level57)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level21 level64)
(sum level43 level24 level67)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level7 level51)
(sum level44 level10 level54)
(sum level44 level14 level58)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level21 level65)
(sum level44 level24 level68)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level7 level52)
(sum level45 level10 level55)
(sum level45 level14 level59)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level21 level66)
(sum level45 level24 level69)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level7 level53)
(sum level46 level10 level56)
(sum level46 level14 level60)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level21 level67)
(sum level46 level24 level70)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level7 level54)
(sum level47 level10 level57)
(sum level47 level14 level61)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level21 level68)
(sum level47 level24 level71)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level7 level55)
(sum level48 level10 level58)
(sum level48 level14 level62)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level21 level69)
(sum level48 level24 level72)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level7 level56)
(sum level49 level10 level59)
(sum level49 level14 level63)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level21 level70)
(sum level49 level24 level73)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level7 level57)
(sum level50 level10 level60)
(sum level50 level14 level64)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level21 level71)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level7 level58)
(sum level51 level10 level61)
(sum level51 level14 level65)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level21 level72)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level7 level59)
(sum level52 level10 level62)
(sum level52 level14 level66)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level21 level73)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level7 level60)
(sum level53 level10 level63)
(sum level53 level14 level67)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level7 level61)
(sum level54 level10 level64)
(sum level54 level14 level68)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level7 level62)
(sum level55 level10 level65)
(sum level55 level14 level69)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level7 level63)
(sum level56 level10 level66)
(sum level56 level14 level70)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level7 level64)
(sum level57 level10 level67)
(sum level57 level14 level71)
(sum level57 level16 level73)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level7 level65)
(sum level58 level10 level68)
(sum level58 level14 level72)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level7 level66)
(sum level59 level10 level69)
(sum level59 level14 level73)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level7 level67)
(sum level60 level10 level70)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level7 level68)
(sum level61 level10 level71)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level7 level69)
(sum level62 level10 level72)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level7 level70)
(sum level63 level10 level73)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level7 level71)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level7 level72)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level7 level73)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level4 level72)
(sum level68 level5 level73)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level4 level73)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level71 level2 level73)

(connected l0 l1)
(fuelcost level17 l0 l1)
(connected l0 l6)
(fuelcost level17 l0 l6)
(connected l1 l0)
(fuelcost level17 l1 l0)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l3)
(fuelcost level2 l1 l3)
(connected l1 l5)
(fuelcost level21 l1 l5)
(connected l1 l9)
(fuelcost level4 l1 l9)
(connected l1 l10)
(fuelcost level4 l1 l10)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l5)
(fuelcost level10 l2 l5)
(connected l2 l7)
(fuelcost level14 l2 l7)
(connected l2 l9)
(fuelcost level2 l2 l9)
(connected l3 l1)
(fuelcost level2 l3 l1)
(connected l4 l8)
(fuelcost level7 l4 l8)
(connected l4 l10)
(fuelcost level3 l4 l10)
(connected l5 l1)
(fuelcost level21 l5 l1)
(connected l5 l2)
(fuelcost level10 l5 l2)
(connected l6 l0)
(fuelcost level17 l6 l0)
(connected l6 l9)
(fuelcost level7 l6 l9)
(connected l6 l10)
(fuelcost level24 l6 l10)
(connected l7 l2)
(fuelcost level14 l7 l2)
(connected l7 l9)
(fuelcost level5 l7 l9)
(connected l7 l10)
(fuelcost level16 l7 l10)
(connected l8 l4)
(fuelcost level7 l8 l4)
(connected l9 l1)
(fuelcost level4 l9 l1)
(connected l9 l2)
(fuelcost level2 l9 l2)
(connected l9 l6)
(fuelcost level7 l9 l6)
(connected l9 l7)
(fuelcost level5 l9 l7)
(connected l10 l1)
(fuelcost level4 l10 l1)
(connected l10 l4)
(fuelcost level3 l10 l4)
(connected l10 l6)
(fuelcost level24 l10 l6)
(connected l10 l7)
(fuelcost level16 l10 l7)

(at t0 l6)
(fuel t0 level73)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
)

(:goal
(and
(at p0 l10)
(at p1 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l6 l0 level56 level17 level73)
   deleted: (at t0 l6) (fuel t0 level73)
   added: (at t0 l0) (fuel t0 level56)
   goals met: 0 of 2
2. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 2
3. (drive t0 l0 l1 level39 level17 level56)
   deleted: (at t0 l0) (fuel t0 level56)
   added: (at t0 l1) (fuel t0 level39)
   goals met: 0 of 2
4. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 2
5. (drive t0 l1 l0 level22 level17 level39)
   deleted: (at t0 l1) (fuel t0 level39)
   added: (at t0 l0) (fuel t0 level22)
   goals met: 0 of 2
6. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 2
7. (drive t0 l0 l1 level5 level17 level22)
   deleted: (at t0 l0) (fuel t0 level22)
   added: (at t0 l1) (fuel t0 level5)
   goals met: 1 of 2
8. (drive t0 l1 l10 level1 level4 level5)
   deleted: (at t0 l1) (fuel t0 level5)
   added: (at t0 l10) (fuel t0 level1)
   goals met: 1 of 2
9. (unload p0 t0 l10)
   deleted: (in p0 t0)
   added: (at p0 l10)
   goals met: 2 of 2
